all outputs:  [u'em_0_dec_Flair/dec_Flair_conv5/Relu:0', u'em_0_dec_Flair_2/dec_Flair_conv5/Relu:0', u'em_0_dec_Flair_3/dec_Flair_conv5/Relu:0', u'em_0_dec_T2/dec_T2_conv5/Relu:0', u'em_0_dec_T2_2/dec_T2_conv5/Relu:0', u'em_0_dec_T2_3/dec_T2_conv5/Relu:0', u'em_concat/concat:0', u'em_fused/ExpandDims:0']
output dict:  {'em_0_dec_T2': <function mae at 0x7f04a97502a8>, 'em_concat': <function embedding_distance at 0x7f04a97501b8>, 'em_fused': <function embedding_distance at 0x7f04a97501b8>, 'em_0_dec_Flair': <function mae at 0x7f04a97502a8>}
loss weights:  {'em_0_dec_T2': 1.0, 'em_concat': 1.0, 'em_fused': 1.0, 'em_0_dec_Flair': 1.0}
/home/aimslab/Desktop/test_multimodal/model.py:372: UserWarning: Update your `Model` call to the Keras 2 API: `Model(outputs=[<tf.Tenso..., inputs=[<tf.Tenso...)`
  self.model = Model(input=self.inputs, output=outputs)
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
enc_T1_input (InputLayer)        (None, 1, 256, 256)   0                                            
____________________________________________________________________________________________________
enc_LPM_input (InputLayer)       (None, 1, 256, 256)   0                                            
____________________________________________________________________________________________________
enc_T1_conv1 (Conv2D)            (None, 32, 256, 256)  320         enc_T1_input[0][0]               
____________________________________________________________________________________________________
enc_LPM_conv1 (Conv2D)           (None, 32, 256, 256)  320         enc_LPM_input[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)        (None, 32, 256, 256)  0           enc_T1_conv1[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)       (None, 32, 256, 256)  0           enc_LPM_conv1[0][0]              
____________________________________________________________________________________________________
enc_T1_conv2 (Conv2D)            (None, 32, 256, 256)  9248        leaky_re_lu_1[0][0]              
____________________________________________________________________________________________________
enc_LPM_conv2 (Conv2D)           (None, 32, 256, 256)  9248        leaky_re_lu_12[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)        (None, 32, 256, 256)  0           enc_T1_conv2[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)       (None, 32, 256, 256)  0           enc_LPM_conv2[0][0]              
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, 32, 128, 128)  0           leaky_re_lu_2[0][0]              
____________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)   (None, 32, 128, 128)  0           leaky_re_lu_13[0][0]             
____________________________________________________________________________________________________
enc_T1_conv3 (Conv2D)            (None, 64, 128, 128)  18496       max_pooling2d_1[0][0]            
____________________________________________________________________________________________________
enc_LPM_conv3 (Conv2D)           (None, 64, 128, 128)  18496       max_pooling2d_3[0][0]            
____________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)        (None, 64, 128, 128)  0           enc_T1_conv3[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)       (None, 64, 128, 128)  0           enc_LPM_conv3[0][0]              
____________________________________________________________________________________________________
enc_T1_conv4 (Conv2D)            (None, 64, 128, 128)  36928       leaky_re_lu_3[0][0]              
____________________________________________________________________________________________________
enc_LPM_conv4 (Conv2D)           (None, 64, 128, 128)  36928       leaky_re_lu_14[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)        (None, 64, 128, 128)  0           enc_T1_conv4[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)       (None, 64, 128, 128)  0           enc_LPM_conv4[0][0]              
____________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)   (None, 64, 64, 64)    0           leaky_re_lu_4[0][0]              
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)   (None, 64, 64, 64)    0           leaky_re_lu_15[0][0]             
____________________________________________________________________________________________________
enc_T1_conv5 (Conv2D)            (None, 128, 64, 64)   73856       max_pooling2d_2[0][0]            
____________________________________________________________________________________________________
enc_LPM_conv5 (Conv2D)           (None, 128, 64, 64)   73856       max_pooling2d_4[0][0]            
____________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)        (None, 128, 64, 64)   0           enc_T1_conv5[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)       (None, 128, 64, 64)   0           enc_LPM_conv5[0][0]              
____________________________________________________________________________________________________
enc_T1_conv6 (Conv2D)            (None, 128, 64, 64)   147584      leaky_re_lu_5[0][0]              
____________________________________________________________________________________________________
enc_LPM_conv6 (Conv2D)           (None, 128, 64, 64)   147584      leaky_re_lu_16[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)        (None, 128, 64, 64)   0           enc_T1_conv6[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)       (None, 128, 64, 64)   0           enc_LPM_conv6[0][0]              
____________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)   (None, 128, 128, 128) 0           leaky_re_lu_6[0][0]              
____________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)   (None, 128, 128, 128) 0           leaky_re_lu_17[0][0]             
____________________________________________________________________________________________________
enc_T1_conv7 (Conv2D)            (None, 64, 128, 128)  73792       up_sampling2d_1[0][0]            
____________________________________________________________________________________________________
enc_LPM_conv7 (Conv2D)           (None, 64, 128, 128)  73792       up_sampling2d_3[0][0]            
____________________________________________________________________________________________________
enc_T1_skip1 (Concatenate)       (None, 128, 128, 128) 0           leaky_re_lu_4[0][0]              
                                                                   enc_T1_conv7[0][0]               
____________________________________________________________________________________________________
enc_LPM_skip1 (Concatenate)      (None, 128, 128, 128) 0           leaky_re_lu_15[0][0]             
                                                                   enc_LPM_conv7[0][0]              
____________________________________________________________________________________________________
enc_T1_conv8 (Conv2D)            (None, 64, 128, 128)  73792       enc_T1_skip1[0][0]               
____________________________________________________________________________________________________
enc_LPM_conv8 (Conv2D)           (None, 64, 128, 128)  73792       enc_LPM_skip1[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)        (None, 64, 128, 128)  0           enc_T1_conv8[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)       (None, 64, 128, 128)  0           enc_LPM_conv8[0][0]              
____________________________________________________________________________________________________
enc_T1_conv9 (Conv2D)            (None, 64, 128, 128)  36928       leaky_re_lu_7[0][0]              
____________________________________________________________________________________________________
enc_LPM_conv9 (Conv2D)           (None, 64, 128, 128)  36928       leaky_re_lu_18[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)        (None, 64, 128, 128)  0           enc_T1_conv9[0][0]               
____________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)       (None, 64, 128, 128)  0           enc_LPM_conv9[0][0]              
____________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)   (None, 64, 256, 256)  0           leaky_re_lu_8[0][0]              
____________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)   (None, 64, 256, 256)  0           leaky_re_lu_19[0][0]             
____________________________________________________________________________________________________
enc_T1_conv10 (Conv2D)           (None, 32, 256, 256)  18464       up_sampling2d_2[0][0]            
____________________________________________________________________________________________________
enc_LPM_conv10 (Conv2D)          (None, 32, 256, 256)  18464       up_sampling2d_4[0][0]            
____________________________________________________________________________________________________
enc_T1_skip2 (Concatenate)       (None, 64, 256, 256)  0           leaky_re_lu_2[0][0]              
                                                                   enc_T1_conv10[0][0]              
____________________________________________________________________________________________________
enc_LPM_skip2 (Concatenate)      (None, 64, 256, 256)  0           leaky_re_lu_13[0][0]             
                                                                   enc_LPM_conv10[0][0]             
____________________________________________________________________________________________________
enc_T1_conv11 (Conv2D)           (None, 32, 256, 256)  18464       enc_T1_skip2[0][0]               
____________________________________________________________________________________________________
enc_LPM_conv11 (Conv2D)          (None, 32, 256, 256)  18464       enc_LPM_skip2[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)        (None, 32, 256, 256)  0           enc_T1_conv11[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)       (None, 32, 256, 256)  0           enc_LPM_conv11[0][0]             
____________________________________________________________________________________________________
enc_T1_conv12 (Conv2D)           (None, 32, 256, 256)  9248        leaky_re_lu_9[0][0]              
____________________________________________________________________________________________________
enc_LPM_conv12 (Conv2D)          (None, 32, 256, 256)  9248        leaky_re_lu_20[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)       (None, 32, 256, 256)  0           enc_T1_conv12[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)       (None, 32, 256, 256)  0           enc_LPM_conv12[0][0]             
____________________________________________________________________________________________________
enc_T1_conv13 (Conv2D)           (None, 4, 256, 256)   1156        leaky_re_lu_10[0][0]             
____________________________________________________________________________________________________
enc_LPM_conv13 (Conv2D)          (None, 4, 256, 256)   1156        leaky_re_lu_21[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)       (None, 4, 256, 256)   0           enc_T1_conv13[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)       (None, 4, 256, 256)   0           enc_LPM_conv13[0][0]             
____________________________________________________________________________________________________
combined_em (Average)            (None, 4, 256, 256)   0           leaky_re_lu_11[0][0]             
                                                                   leaky_re_lu_22[0][0]             
____________________________________________________________________________________________________
lambda_1 (Lambda)                (None, None)          0           leaky_re_lu_11[0][0]             
____________________________________________________________________________________________________
lambda_3 (Lambda)                (None, None)          0           leaky_re_lu_22[0][0]             
____________________________________________________________________________________________________
lambda_2 (Lambda)                (None, 1, None)       0           lambda_1[0][0]                   
____________________________________________________________________________________________________
lambda_4 (Lambda)                (None, 1, None)       0           lambda_3[0][0]                   
____________________________________________________________________________________________________
lambda_5 (Lambda)                (None, None)          0           combined_em[0][0]                
____________________________________________________________________________________________________
em_0_dec_Flair (Model)           multiple              30149       leaky_re_lu_11[0][0]             
                                                                   leaky_re_lu_22[0][0]             
                                                                   combined_em[0][0]                
____________________________________________________________________________________________________
em_0_dec_T2 (Model)              multiple              30149       leaky_re_lu_11[0][0]             
                                                                   leaky_re_lu_22[0][0]             
                                                                   combined_em[0][0]                
____________________________________________________________________________________________________
em_concat (Concatenate)          (None, 2, None)       0           lambda_2[0][0]                   
                                                                   lambda_4[0][0]                   
____________________________________________________________________________________________________
em_fused (Lambda)                (None, 1, None)       0           lambda_5[0][0]                   
====================================================================================================
Total params: 1,096,850
Trainable params: 1,096,850
Non-trainable params: 0